/step/4

Любой объект может содержать - свойства и методы
Некоторая величина при объекте называется - свойство
Часть кода, присвоенная свойству объекта это - метод
В метод можно передать - аргумент
Метод обязательно должен входить в какой-либо - объект

/step/11

Выполнение кода function Person(name, age, year) { this.name = name;} создаст конструктор для объекта person
Если присвоить значению какого-либо свойства код, то мы получим метод
Ключевое слово this используется для доступа к объекту, из которого оно вызывается
